Tekla.Structures.ModelInternal.Dstv.HeaderFields
The header fields available in Dstv.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.Filename
The filename.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.ProjectNumber
The project number.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.PhaseNumber
The phase number.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.PartMark
The part mark.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.DrawingMark
The drawing mark.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.Material
The material.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.Quantity
The quantity.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.Profile
The profile.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.ProfileType
The Profile type.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.NetLength
The net length.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.GrossLength
The gross length.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.ProfileHeight
The profile height.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.FlangeHeight
The flange height.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.FlangeThickness
The flange thickness.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.WebThickness
The web thickness.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.Radius
The radius.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.MeterWeight
The weight by meter.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.FinishArea
The painting surface by meter.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.WebAngleFront
The skew angle for web's front.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.WebAngleBack
The skew angle for web's back.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.FlangeAngleFront
The skew angle for flange's front.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.FlangeAngleBack
The skew angle for flange's back.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.InfoText1
The information text 1.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.InfoText2
The information text 2.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.InfoText3
The information text 3.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.InfoText4
The information text 4.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.Comments
The list of comments.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.IsValid(System.String)
Checks if the field name is a valid dstv header field.

Tekla.Structures.ModelInternal.Dstv.HeaderFields.ApplyPrecision(System.String)
Check if the header field needs precision when is formatted.